customer_service/app/services/order_events/consume_service.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = '706ce783-d46b-49a1-b59a-8314f00d79f7' LIMIT 1
UPDATE "customers" SET "orders_count" = COALESCE("orders_count", 0) + 1 WHERE "customers"."id" = '706ce783-d46b-49a1-b59a-8314f00d79f7'
---
    def self.start
      connection = Bunny.new(hostname: ENV['RABBITMQ_HOST'] || 'localhost')
      connection.start

      channel = connection.create_channel
      queue = channel.queue('order_events', durable: true)
      exchange = channel.direct('orders_exchange', durable: true)
      queue.bind(exchange, routing_key: 'order.created')

      Rails.logger.info("Waiting for messages in the queue 'order_events'...")

      queue.subscribe(block: true, manual_ack: true) do |delivery_info, _properties, payload|
        begin
          data = JSON.parse(payload)
          Rails.logger.info("Message arrived: #{data}")
          customer = Customer.find_by(id: data["customer_id"])

          if customer
            customer.increment!(:orders_count)