order_service/app/services/orders/create_service.rb

    def self.call(params)
      customer_id = params[:customer_id]
      customer = Customers::CustomerClient.get_customer(customer_id)
      order = nil
      raise "Customer not found" unless customer
        ActiveRecord::Base.transaction do
        order = ::Order.create!(
          customer_id: customer_id,
          product_name: params[:product_name],
          quantity: params[:quantity],
          price: params[:price],
          status: params[:status],
          client_name: customer["name"],
          client_address: customer["address"]
        )
---
INSERT INTO "orders" ("customer_id", "product_name", "quantity", "price", "status", "client_name", "client_address", "created_at", "updated_at") VALUES ('706ce783-d46b-49a1-b59a-8314f00d79f7', 'Macbook Air', 2, 1400.99, 0, 'Juan Pérez', 'Calle Falsa 123, Bogotá', '2025-07-02 22:00:18.232209', '2025-07-02 22:00:18.232209') RETURNING "id"