customer_service/app/services/customers/find_by_id_service.rb

SELECT "customers".* FROM "customers" WHERE "customers"."id" = '706ce783-d46b-49a1-b59a-8314f00d79f7' LIMIT 1
---
    def self.call(id)
      ::Customer.find_by(id: id)